In [30]:
import pandas as pd
import numpy as np
import re

In [2]:
students = [{
    'Name': 'Inam',
    'Age': 42
},
{
    'Name': 'Ali',
    'Age': 22,
    'Course': 'AI'
},{
    'Name': 'Daniyal',
    'Age': 42,
    'Course': 'CNCF'
},{
    'Name': 'Mohsin',    
    'Course': 'CNCF'
},{
    'Name': 'Aamir',
    'Age': 22
},{
    'Name': 'Aamir',
    'Age': 22
},{
    'Name': 'Aamir',
    'Age': 22,
    'Course': 'CNCF'
}]

In [3]:
students_df = pd.DataFrame(students)
students_df

    Age Course     Name
0  42.0    NaN     Inam
1  22.0     AI      Ali
2  42.0   CNCF  Daniyal
3   NaN   CNCF   Mohsin
4  22.0    NaN    Aamir
5  22.0    NaN    Aamir
6  22.0   CNCF    Aamir

In [7]:
pd.value_counts(students_df['Course'])

CNCF    3
AI      1
Name: Course, dtype: int64

In [15]:
students_df.notnull()

     Age  Course  Name
0   True    True  True
1   True    True  True
2   True    True  True
3  False    True  True
4   True   False  True

In [17]:
dropped_df = students_df.dropna()
dropped_df

    Age Course     Name
0  42.0     AI     Inam
1  22.0     AI      Ali
2  42.0   CNCF  Daniyal

In [18]:
students_df

    Age Course     Name
0  42.0     AI     Inam
1  22.0     AI      Ali
2  42.0   CNCF  Daniyal
3   NaN   CNCF   Mohsin
4  22.0    NaN    Aamir

In [45]:
filled_df = students_df.fillna({'Age': students_df['Age'].mean(), 'Course': 'Un-Known'})
filled_df

         Age    Course     Name
0  42.000000  Un-Known     Inam
1  22.000000        AI      Ali
2  42.000000      CNCF  Daniyal
3  28.666667      CNCF   Mohsin
4  22.000000  Un-Known    Aamir
5  22.000000  Un-Known    Aamir
6  22.000000      CNCF    Aamir

In [46]:
filled_df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [41]:
droped_dup_df = filled_df.drop_duplicates(keep='last')
droped_dup_df

    Age    Course     Name
0  42.0  Un-Known     Inam
1  22.0        AI      Ali
2  42.0      CNCF  Daniyal
3  30.0      CNCF   Mohsin
5  22.0  Un-Known    Aamir

In [52]:
twice_age = droped_dup_df['Age'].map(lambda val: val * 2)
twice_age

0    84.0
1    44.0
2    84.0
3    60.0
5    44.0
Name: Age, dtype: float64

In [61]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'], 
            columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [67]:
data = data.rename(index=str.title, columns=str.upper)
data

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [9]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [10]:
freq_group = pd.cut(ages, bins, labels=group_names)
freq_group

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [76]:
freq_group.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [77]:
freq_group.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [6]:
 pd.value_counts(freq_group)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [19]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(3)
sampler

array([0, 1, 2])

In [22]:
sampler = np.random.permutation(3)
df.take(sampler)

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [18]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
1   4   5   6   7

In [23]:
students_df

    Age Course     Name
0  42.0    NaN     Inam
1  22.0     AI      Ali
2  42.0   CNCF  Daniyal
3   NaN   CNCF   Mohsin
4  22.0    NaN    Aamir
5  22.0    NaN    Aamir
6  22.0   CNCF    Aamir

In [27]:
students_df.join(pd.get_dummies(students_df['Course']))

    Age Course     Name  AI  CNCF
0  42.0    NaN     Inam   0     0
1  22.0     AI      Ali   1     0
2  42.0   CNCF  Daniyal   0     1
3   NaN   CNCF   Mohsin   0     1
4  22.0    NaN    Aamir   0     0
5  22.0    NaN    Aamir   0     0
6  22.0   CNCF    Aamir   0     1

In [29]:
students_df['Name'].map(str.upper)

0       INAM
1        ALI
2    DANIYAL
3     MOHSIN
4      AAMIR
5      AAMIR
6      AAMIR
Name: Name, dtype: object

In [38]:
emailids = 'inam@hotmail.com, inampaki@yahoo.com, inamsdhhs, basit#.com' 
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [39]:
regex.findall(emailids)

['inam@hotmail.com', 'inampaki@yahoo.com']

In [41]:
students_df['Name_In_Caps'] = students_df['Name'].str.upper()

In [42]:
students_df

    Age Course     Name Name_In_Caps
0  42.0    NaN     Inam         INAM
1  22.0     AI      Ali          ALI
2  42.0   CNCF  Daniyal      DANIYAL
3   NaN   CNCF   Mohsin       MOHSIN
4  22.0    NaN    Aamir        AAMIR
5  22.0    NaN    Aamir        AAMIR
6  22.0   CNCF    Aamir        AAMIR